import UIKit


/*:
 # Programming Basic
 */
/*:
## 1) ⭐️ 프로그래밍에서 사용하는 = (등호)의 의미
### 제 1원칙
* 프로그래밍에서 사용하는 = (equal)은 할당의 의미이다. (할당연산자)
---
*/
//: >  = (등호)는 같다는 뜻이 아니다.
// = (등호)를 기준으로 오른쪽에 있는 무언가를 왼쪽에 담는다는 의미(할당)



var a = 5


a = a + 7



// 프로그래밍에서 같다는 것은 == 를 사용
// ==  (같다)
// !=  (같지 않다)





/*:
## 2) 대문자와 소문자의 엄격한 구분
* 대부분의 첫글자는 소문자로 시작한다. (예외적으로 대문자 시작)
---
*/
// 중간에는 대문자/숫자가 쓰일 수 있다. 다만, 시작은 소문자
// 캐멀케이스(camel: 낙타)



var nameOfYou = "홍길동"









/*:
## 3) 키워드(Keyword)
* 약속어 (스위프트에서 특별한 의미로 사용하겠다고 미리 정해놓은 단어)
---
*/
// 약 70여개의 키워드 존재
// 참고 https://www.tutorialkart.com/swift-tutorial/swift-keywords/
// 키워드는 다른 의미로 사용 불가능


//var

//func

//if









